#include <iostream>
#include "Set.h"
#include "Money.h"

using namespace std;

int main() {
	setlocale(LC_ALL, "Rus");


	Set<Money> a(4);
	cin >> a;
	cout << "===================================================\nÂàøå ìíîæåñòâî:\n";
	cout << a;
	
	cout << "\n===================================================\nÏðîâåðêà îïåðàòîðîâ:\n";
	Set<Money> b(4);
	b = a;
	cout << "ÎÏÅÐÀÒÎÐ ÏÐÈÑÂÀÈÂÀÍÈß\nÌíîæåñòâî a: " << a << "    ìíîæåñòâî b: " << b << "\n\n\n";
	
	cout << "ÎÏÅÐÀÒÎÐ ÄÎÑÒÓÏÀ ÏÎ ÈÍÄÅÊÑÓ\nÈñõîäíîå ìíîæåñòâî: " << a << "\n";
	int index;
	cout << "Ââåäèòå èíäåêñ >> "; cin >> index;
	cout << "Ýëåìåíò ïîä èíäåêñîì " << index << ": " << a[index] << "\n\n\n";

	cout << "ÎÏÅÐÀÒÎÐ ÑËÎÆÅÍÈß\nÈñõîäíîå ìíîæåñòâî: " << a << "\n";
	Money m;
	cin >> m;
	b = a + m;
	cout << "Ïîëó÷åííîå ìíîæåñòâî: " << b << "\n\n\n";

	cout << "ÏÎËÓ×ÅÍÈÅ ÄËÈÍÛ ÌÍÎÆÅÑÒÂÀ\nÈñõîäíîå ìíîæåñòâî: " << a << "\n";
	cout << "Äëèíà äàííîãî ìíîæåñòâà: " << a() << "\n\n\n";

	cout << "ÎÏÅÐÀÒÎÐ ÏÐÎÂÅÐÊÈ ÍÀ ÏÐÈÍÀÄËÅÆÍÎÑÒÜ\nÈñõîäíîå ìíîæåñòâî: " << a << "\n";
	cin >> m;
	if (a > m)
		cout << m << " ïðèíàäëåæèò ìíîæåñòâó";
	else
		cout << m << " íå ïðèíàäëæåèò ìíîæåñòâó";




	return 0;
}